VPro/src/Catalogs/SuppliersProductsAndServices/SuppliersProductsAndServices.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>SuppliersProductsAndServices</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.Counterparties</owners>
  <attributes>
    <name>ProductsAndServices</name>
    <type>
      <types>CatalogRef.ProductsAndServices</types>
    </type>
  </attributes>
  <attributes>
    <name>Characteristic</name>
    <type>
      <types>CatalogRef.ProductsAndServicesCharacteristics</types>
    </type>
  </attributes>
  <attributes>
    <name>SKU</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>110</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>AdditionalAttributes</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AdditionalAttributesAndInformation</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.AdditionalAttributesAndInformation</types>
      </type>
    </attributes>
    <attributes>
      <name>TextString</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

VPro/src/Catalogs/SuppliersProductsAndServices/ObjectModule.bsl
#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

Procedure BeforeWrite(Cancel)
	
	Query = New Query;
	Query.Text = 
	"SELECT TOP 1
	|	SuppliersProductsAndServices.Ref
	|FROM
	|	Catalog.SuppliersProductsAndServices AS SuppliersProductsAndServices
	|WHERE
	|	SuppliersProductsAndServices.Owner = &Owner
	|	AND SuppliersProductsAndServices.SKU = &SKU
	|	AND SuppliersProductsAndServices.ID = &ID
	|	AND SuppliersProductsAndServices.ProductsAndServices = &ProductsAndServices
	|	AND SuppliersProductsAndServices.Characteristic = &Characteristic
	|	AND SuppliersProductsAndServices.Ref <> &CurrentRef";
	
	Query.SetParameter("Owner", Owner);
	Query.SetParameter("SKU", SKU);
	Query.SetParameter("ID", ID);
	Query.SetParameter("ProductsAndServices", ProductsAndServices);
	Query.SetParameter("Characteristic", Characteristic);
	Query.SetParameter("CurrentRef", Ref);
	
	Result = Query.Execute();
	If Not Result.IsEmpty() Then
		
		MessageText = StringFunctionsClientServer.SubstituteParametersInString(
			NStr("en='Mapping ""%1,%2,%3 - %4,%5"" is already in the catalog. Writing is canceled.';ru='Соответствие ""%1,%2,%3 - %4,%5"" уже присутствует в справочнике. Запись отменена.';vi='Tương quan ""%1,%2,%3 - %4,%5"" đã tồn tại trong danh mục. Bỏ qua việc ghi lại.'"),
			Owner, SKU, ID, ProductsAndServices, Characteristic
		);
		
		Message = New UserMessage();
		Message.Text = MessageText;
		Message.Message();
		
		Cancel = True;
		
	EndIf;
	
EndProcedure

#EndIf
